In [58]:
import pandas as pd

In [59]:
#Reading an files using pandas 
#1 CSV - pd.read_csv('file.csv')
#2 Excel - df = pd.read_excel("file.xlsx", sheet_name="Sheet1")
#3 SQL - conn =   sqlite3.connect("mydatabase.db") 
                # df = pd.read_sql("SELECT * FROM mytable", conn)
#4 Javascrpit - df = pd.read_json("file.json")

In [60]:
#Series

In [61]:
#creating a series from list
s1=pd.Series([31,32,3,1,67])
s1

0    31
1    32
2     3
3     1
4    67
dtype: int64

In [62]:
#creating a series with index
s2=pd.Series([31,32,3,1,67],index=['a','b','c','d','e'])
s2

a    31
b    32
c     3
d     1
e    67
dtype: int64

In [63]:
# Creating a series From dictionary
s3= pd.Series({'a': 100, 'b': 200, 'c': 300})
s3

a    100
b    200
c    300
dtype: int64

In [64]:
#DataFrame

In [65]:
data={
    'Name':['A','B','C','D','E'],
    'Age':[17,16,20,21,22],
}
df=pd.DataFrame(data)
df

  Name  Age
0    A   17
1    B   16
2    C   20
3    D   21
4    E   22

In [66]:
#Basic Operations

In [67]:
print('Data Types : \n',df.dtypes) #data types of all columnc

Data Types :
 Name    object
Age      int64
dtype: object

In [68]:
print('Size :',df.size) # size i.e total elments

Size : 10

In [69]:
print('Shape :',df.shape) #shape i.e rows ,columns

Shape : (5, 2)

In [70]:
print('Index info :',df.index)

Index info : RangeIndex(start=0, stop=5, step=1)

In [71]:
print(df.info())     # Summary of DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes
None

In [72]:
print(df.describe()) # Stats (for numeric columns)

             Age
count   5.000000
mean   19.200000
std     2.588436
min    16.000000
25%    17.000000
50%    20.000000
75%    21.000000
max    22.000000

In [73]:
#Indexing and Selection

In [74]:
#loc[] → label-based selection (uses row/column names)
#iloc[] → position-based selection (uses row/column numbers)

In [75]:
# Using loc (labels)
print(df.loc[0])              # Row with index 0

Name     A
Age     17
Name: 0, dtype: object

In [76]:
print(df.loc[0:2, ["Name"]])  # First 3 rows, only "Name" colu

  Name
0    A
1    B
2    C

In [77]:
# Using iloc (positions)
print(df.iloc[0])             # First row

Name     A
Age     17
Name: 0, dtype: object

In [78]:
print(df.iloc[0:2, 0:2])      # First 2 rows, first 2 columns

  Name  Age
0    A   17
1    B   16

In [79]:
# Selecting a single column
print(df["Name"])      # Series

0    A
1    B
2    C
3    D
4    E
Name: Name, dtype: object

In [80]:
print(df[["Name", "Age"]])  # Multiple columns as DataFrame

  Name  Age
0    A   17
1    B   16
2    C   20
3    D   21
4    E   22

In [81]:
#Slicing

In [82]:
print(df[0:2])   # First 2 rows
print(df[1:])    # All rows except first

  Name  Age
0    A   17
1    B   16
  Name  Age
1    B   16
2    C   20
3    D   21
4    E   22

In [83]:
#Adding column 
df['Salary']=[10000,17000,18000,10000,20000]
df

  Name  Age  Salary
0    A   17   10000
1    B   16   17000
2    C   20   18000
3    D   21   10000
4    E   22   20000

In [84]:
# Renaming columns
df = df.rename(columns={"Name": "Full_Name", "Age": "Years",'Salary':'Monthly Salary'})
df

  Full_Name  Years  Monthly Salary
0         A     17           10000
1         B     16           17000
2         C     20           18000
3         D     21           10000
4         E     22           20000

In [85]:
df=df.rename(columns={ "Full_Name":"Name", "Years" : "Age" ,'Monthly Salary':'Salary'})
df

  Name  Age  Salary
0    A   17   10000
1    B   16   17000
2    C   20   18000
3    D   21   10000
4    E   22   20000

In [86]:
#dropping column
#df=df.drop(columns=['Salary'])

In [87]:
#sorting
# Sort by Salary (ascending)
print(df.sort_values(by="Salary"))

# Sort by Age (descending)
print(df.sort_values(by="Age", ascending=False))

  Name  Age  Salary
0    A   17   10000
3    D   21   10000
1    B   16   17000
2    C   20   18000
4    E   22   20000
  Name  Age  Salary
4    E   22   20000
3    D   21   10000
2    C   20   18000
0    A   17   10000
1    B   16   17000

In [88]:
#Lambda function in pandas

In [90]:
# Increase salary by 10%
df["Updated_Salary"] = df["Salary"].apply(lambda x: x * 1.1)
df

  Name  Age  Salary  Updated_Salary
0    A   17   10000         11000.0
1    B   16   17000         18700.0
2    C   20   18000         19800.0
3    D   21   10000         11000.0
4    E   22   20000         22000.0

In [92]:
# Tag employees as "Senior" if Age > 30 else "Junior"
df["Category"] = df["Age"].apply(lambda x: "Senior" if x > 20 else "Junior")
df

  Name  Age  Salary  Updated_Salary Category
0    A   17   10000         11000.0   Junior
1    B   16   17000         18700.0   Junior
2    C   20   18000         19800.0   Junior
3    D   21   10000         11000.0   Senior
4    E   22   20000         22000.0   Senior